---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PropertySegmentRadius
source: html/c9c8155b-7c10-b1fe-87eb-96690f1cc8d4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PropertySegmentRadius Property

"Radius"

## Syntax (C#)
```csharp
public static ForgeTypeId PropertySegmentRadius { get; }
```